function test2()
    % ----------------------------------------
    % ανάγνωση αρχείου & δημιουργία dictionary
    % ----------------------------------------
    [dict, data] = huffmandict2('./cvxopt.txt');
    disp('Περιεχόμενα του αρχείου:');
    disp(data);

    % ---------------------------
    % 2) β) Yπολογισμός εντροπίας, μέσου μήκους κώδικα, απόδοσης
    % ---------------------------

    A = dict(:,1);  % συμβολα => αλφάβητο
    p = dict(:,3);  % πιθανότητες
    c = dict(:, 2); % κώδικες
    H = 0;          % εντροπία
    L = 0;          % μέσο μήκος κώδικα
    n = 0;          % απόδοση

    [m, ~] = size(A);
    for i=1:m
        H = H + p{i} * log2(1 ./ p{i});
    end
    disp('Η(Φ) = ');
    disp(H);

    for i=1:m
        % μήκος του i-οστού κώδικα
        li = length(c{i});
        L = L + p{i} * li;
    end
    disp('L = ');
    disp(L);

    Lmin = H;   % η Lmin = H(Φ)
    n = Lmin ./ L;
    disp('Απόδοση = ');
    disp(n);

    % --------------------------------------------------
    % δημιουργία κωδικοποιημένης μορφής των περιεχομένων
    % --------------------------------------------------
    encoded_data = huffmanenco(dict, data);
    disp('Μετά την κωδικοποίηση:');
    disp(encoded_data);

    % ---------------
    % αποκωδικοποίηση
    % ---------------
    decoded_data = huffmandeco(dict, encoded_data);
    disp('Αποκωδικοποιημένο κείμενο:');
    disp(decoded_data);
end